app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Ship of Theseus"], ["rating", "R"], ["release_date", "2018-10-07 00:00:00.000000"], ["created_at", "2018-10-07 21:01:04.951192"], ["updated_at", "2018-10-07 21:01:04.951192"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 71]]
---
  def director
    @movie=Movie.find(params[:id])